/*
39. Напишите программу, которая перевернёт одномерный массив 
(последний элемент будет на первом месте, а первый - на последнем и т.д.)
*/
Console.Clear();
int Rrompt(string massage)
{
   System.Console.WriteLine(massage);
   string value=Console.ReadLine();
   int result=Convert.ToInt32(value);
   return result;    
}

void PrintArray(int[] arr)
{
    Console.ForgroundColor=ConsoleColor.Green;
    System.Console.Write("[");
    for (int i = 0; i < length; i++)
    {
        Console.ForgroundColor=ConsoleColor.Cyan;
        Thread
    }
}